tutorials/rheoEFoam/channelEDF/PowerLaw/NernstPlanck/0/ciAnion
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      ciAnion;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 -3 0 0 1 0 0 ];

internalField   uniform 9.43798e-05;

boundaryField
{
    inlet
    {
	type            cyclic;
    }
    
    outlet
    {
	type            cyclic;      
    }
    
    symmetry
    {
	type            symmetryPlane;    
    }
    
    walls
    {
	type            boltzmannEquilibrium;
	c0              9.43798e-05;
	psi0            0;
	value           uniform 9.43798e-05; 
    }
    

    frontAndBack
    {
	type            empty;   
    }
}

// ************************************************************************* //
